<template>
  <div class="aboutPage">
    <h1>Немного о себе в мире IT</h1>
    <p>Большую часть своей профессиональной жизни я&nbsp;работал в&nbsp;сфере организации мероприятий, но&nbsp;последнее время испытывал сильное желание изменить направление своего дальнейшего развития.</p>
<p>Мне всегда была интересна тема компьютеров и&nbsp;программирования. В&nbsp;юности я&nbsp;ходил на&nbsp;курсы по&nbsp;Borland Pascal и&nbsp;C++, а&nbsp;дома пытался верстать свои первые сайты.</p>
<p>Благодаря возможностям, который предоставил 2020&nbsp;год, я&nbsp;осознал, что хочу двигаться в&nbsp;направлении развития своей карьеры в&nbsp;сфере IT. Первым делом, я&nbsp;принял участие в&nbsp;трехдневном интенсиве по&nbsp;написанию мессенджера на&nbsp;языке python. Пройдя его, я&nbsp;еще раз убедился, что мне нравится писать код, разбираться в&nbsp;особенностях языка программирования и&nbsp;видеть результат своих трудов на&nbsp;экране монитора. Всё взвесив, осознал, что наиболее интересная сфера для меня&nbsp;&mdash; фронтенд-разработка. Поэтому я&nbsp;начал искать варианты школ, где смог&nbsp;бы получить необходимые знания. Я&nbsp;остановил свой выбор на&nbsp;образовательной платформе GeekBrains и&nbsp;с&nbsp;конца мая 2020 года приступил к&nbsp;учебе на&nbsp;факультете &laquo;Фронтенд-разработчик&raquo;.</p>
<p>В&nbsp;июле прекратил работать в&nbsp;ивент-агентстве, чтобы полностью сосредоточиться на&nbsp;программировании.</p>
<p>За&nbsp;неполный год обучения я&nbsp;получил знания, которые могу успешно применять в&nbsp;работе при создании веб-приложений.</p>
<br>
<p>Что я&nbsp;умею:</p>
<ul><li>&mdash;&nbsp;Писать код на&nbsp;языке программирования JavaScript (знание основ языка, работа с&nbsp;DOM, методология ООП, canvas, работа с&nbsp;API);</li>
<li>&mdash;&nbsp;Использовать популярные фреймворки, библиотеки и&nbsp;системы (git, react, connected-react-router, redux, vue, vue-router, vuex, node.js, npm, webpack, ajax, axios, bootstrap, material-ui, vuetify);</li>
<li>&mdash;&nbsp;Верстать при помощи языка разметки HTML и&nbsp;применять стили через CSS;</li>
<li>&mdash;&nbsp;Использовать медиазапросы для адаптивной верстки и&nbsp;применять принцип &laquo;mobile first&raquo;;</li>
<li>&mdash;&nbsp;Писать стили на&nbsp;нескольких препроцессорах (SCSS, LESS);</li>
<li>&mdash;&nbsp;&laquo;Нарезать&raquo; макет в&nbsp;Adobe Photoshop, Marsy;</li>
<li>&mdash;&nbsp;Работать с&nbsp;приложениями для управления проектами (Wrike).</li></ul>
<br>
<ul>Имею представление:
<li>&mdash;&nbsp;jQuery (читал образовательные статьи, использовал некоторые команды библиотеки во&nbsp;время обучения языку JavaScript);</li>
<li>&mdash;&nbsp;MySQL (в&nbsp;программе обучения был отдельный блок с&nbsp;базовыми командами системы);</li>
<li>&mdash;&nbsp;Jasmine (был отдельный урок в&nbsp;рамках курса JavaScript, посвященный тестам);</li>
<li>&mdash;&nbsp;Agile-методологии (был отдельный урок по&nbsp;гибким методологиям разработки + смотрел обучающие видео в&nbsp;интернете);</li>
<li>&mdash;&nbsp;Jira (смотрел обучающее видео в&nbsp;интернете);</li>
<li>&mdash;&nbsp;Figma (смотрел обучающее видео в&nbsp;интернете);</li>
<li>&mdash;&nbsp;Nuxt.js (смотрел обучающее видео в интернете)</li>
<li>&mdash;&nbsp;TypeScript (смотрел обучающее видео в интернете, читал статьи)</li>
<li>&mdash;&nbsp;Документирование кода (читал статьи про JSDoc и&nbsp;documentation.js).</li></ul>
<br>
<p>За&nbsp;прошедший год, программирование стало важной частью моей жизни. Помимо материала и&nbsp;заданий, которые давали во&nbsp;время обучения в&nbsp;GeekBrains, я&nbsp;дополнительно читал статьи на&nbsp;специализированных ресурсах (habr.com, stackoverflow.com, learn.javascript.ru, developer.mozilla.org), смотрел вебинары и&nbsp;учебные видеоролики на&nbsp;youtube-каналах (JavaScript.Ninja, Владилен Минин, Java и&nbsp;Sкрипты), научился &laquo;слепой&raquo; печати на&nbsp;двух языках (русский и&nbsp;английский) и&nbsp;даже помогал студентам GeekBrains, в&nbsp;качестве наставника, на&nbsp;курсе по&nbsp;react.</p>
<p>Кроме того, во&nbsp;время стажировки в&nbsp;GeekBrains, принял участие в&nbsp;разработке приложения, работая в&nbsp;команде с&nbsp;другими фронтенд и&nbsp;фуллстек разработчиками.</p>
<p>Несмотря на&nbsp;то, что обучение в&nbsp;GeekBrains подошло к&nbsp;концу, я&nbsp;продолжаю развиваться в&nbsp;направлении веб-разработки и&nbsp;пополнять свой список новыми навыками.</p>
<br>
<p>Моим дополнительным плюсом является&nbsp;то, что, благодаря большому опыту менеджерской работы, у&nbsp;меня хорошо развиты софт-скиллы: тайм-менеджмент, работа в&nbsp;команде, умение грамотно ставить задачи и&nbsp;выявлять потребности заказчика, коммуникативные навыки.</p>
<br>
<p>Портфолио с&nbsp;примерами моих работ:<br>
https://github.com/vladsmit/portfolio</p>
<br>
<p>Ссылки на&nbsp;мои профили в&nbsp;Instagram и&nbsp;GeekBrains:<br>
https://www.instagram.com/vladsmit<br>
https://geekbrains.ru/users/4364736</p>
  </div>
</template>
